test/data/grant-payment-payload_01.json

{
  "sbi": "106480734",
  "frn": "1102285668",
  "claimId": "R00000036",
  "scheme": "SFI",
  "grants": [
    {
      "sourceSystem": "FPTT",
      "deliveryBody": "RP00",
      "paymentRequestNumber": 1,
      "correlationId": "f7297a7d-15d1-407d-a246-e2988680b93d",
      "invoiceNumber": "R00000036-V001QX",
      "originalInvoiceNumber": "",
      "agreementNumber": "FPTT175063071",
      "totalAmountPence": "27284",
      "currency": "GBP",
      "marketingYear": "2026",
      "payments": [
        {
          "dueDate": "2026-08-15",
          "totalAmountPence": "6821",
          "status": "pending",
          "invoiceLines": [
            {
              "amountPence": "21",
              "description": "2026-08-15: Parcel: 6898: Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            },
            {
              "amountPence": "6800",
              "description": "2026-08-15: One-off payment per agreement per year for Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            }
          ],
          "correlationId": "95e0545d-94c8-4fc1-9fab-3ff2fbff9e40"
        },
        {
          "dueDate": "2026-11-15",
          "totalAmountPence": "6821",
          "status": "pending",
          "invoiceLines": [
            {
              "amountPence": "21",
              "description": "2026-11-15: Parcel: 6898: Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            },
            {
              "amountPence": "6800",
              "description": "2026-11-15: One-off payment per agreement per year for Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            }
          ],
          "correlationId": "4c57f46e-0b26-4666-9ca3-3a5ba47e2852"
        },
        {
          "dueDate": "2027-02-15",
          "totalAmountPence": "6821",
          "status": "pending",
          "invoiceLines": [
            {
              "amountPence": "21",
              "description": "2027-02-15: Parcel: 6898: Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            },
            {
              "amountPence": "6800",
              "description": "2027-02-15: One-off payment per agreement per year for Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            }
          ],
          "correlationId": "7f144124-ea06-4dc8-bfbb-74f39976dc1c"
        },
        {
          "dueDate": "2027-05-15",
          "totalAmountPence": "6821",
          "status": "pending",
          "invoiceLines": [
            {
              "amountPence": "21",
              "description": "2027-05-15: Parcel: 6898: Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            },
            {
              "amountPence": "6800",
              "description": "2027-05-15: One-off payment per agreement per year for Assess moorland and produce a written record",
              "schemeCode": "CMOR1"
            }
          ],
          "correlationId": "8356ba7f-e496-4d52-8bb4-beb9a25f4095"
        }
      ]
    }
  ]
}
